{
  "Comment.nvim": { "branch": "master" },
  "alpha-nvim": { "branch": "main" },
  "barbecue": { "branch": "main" },
  "bufferline.nvim": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-vsnip": { "branch": "main" },
  "conform.nvim": { "branch": "master" },
  "diagflow.nvim": { "branch": "main" },
  "dressing.nvim": { "branch": "master" },
  "friendly-snippets": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "glow.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lspkind-nvim": { "branch": "master" },
  "lspkind.nvim": { "branch": "master" },
  "lualine-lsp-progress": { "branch": "master" },
  "lualine-so-fancy.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "mini.nvim": { "branch": "main" },
  "mini.pairs": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-navic": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "outline.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "telescope.nvim": { "branch": "master" },
  "typst-preview.nvim": { "branch": "master" },
  "vim-floaterm": { "branch": "master" },
  "vim-vsnip": { "branch": "master" },
  "workspaces.nvim": { "branch": "master" }
}